In [5]:
import pandas as pd

df = pd.read_csv('../robert_moses_rows.csv')
df.head(2)

,name,borough,names,location,latitude,longitude,combined
0,Gerard P. Dugan Playground,Staten_Island,robert moses,NaN,40.561331,-74.110720,"Gerard P. Dugan Playground, Staten_Island"
1,William E. Kelly Park,Brooklyn,robert moses,NaN,40.603729,-73.957674,"William E. Kelly Park, Brooklyn"

In [7]:
count_df = df.groupby('borough').size().reset_index(name='count')
count_df

         borough  count
0          Bronx     54
1       Brooklyn     63
2      Manhattan     77
3         Queens     96
4  Staten_Island     11

In [8]:
count_df.to_csv('count_df.csv', index=False)